#! /bin/sh

# 8x8の盤上で行われたリバーシのログが、以下の様な形式で与えられます。
# 
# 60
#

cat <<EOF | ruby B014.rb 
3 3 3
###
##.
#..
--
##.
##.
...
--
##.
##.
...
--
EOF
# Answer
# ---
# 00-18 The white won!
cat <<EOF

Answer
--
##.
##.
###
--
EOF
# ---
# 

cat <<EOF | ruby B014.rb 
5 5 5
#####
#####
#####
#####
#####
--
#####
#...#
#...#
#...#
#####
--
#####
#...#
#...#
#...#
#####
--
#####
#...#
#...#
#...#
#####
--
#####
#####
#####
#####
#####
--
EOF
# Answer
# ---
# 00-18 The white won!
cat <<EOF

Answer
--
#####
#####
#####
#####
#####
--
EOF
# ---
# 
